IdeaRS.OpenModel.Detail.HangingAroundPatch
Representing of hanging hanging around patch load/support in IDEA StatiCa Detail

IdeaRS.OpenModel.Detail.HangingAroundPatch.#ctor
Constructor

IdeaRS.OpenModel.Detail.HangingAroundPatch.MasterComponent
Master component of hanging

IdeaRS.OpenModel.Detail.HangingAroundPatch.NumOfBarsInLayer
Number of bars in layer

IdeaRS.OpenModel.Detail.HangingAroundPatch.Diameter
Diameter o reinforcement

IdeaRS.OpenModel.Detail.HangingAroundPatch.EndsType
End type of the reinforcement bar - same for both ends

IdeaRS.OpenModel.Detail.HangingAroundPatch.DiameterOfMandrel
Diameter of mandrel - multiplier of bar diameter to obtain inner diameter of bent reinforcement bars

IdeaRS.OpenModel.Detail.HangingAroundPatch.DistanceFromPatch
Distance from patch support/load

IdeaRS.OpenModel.Detail.HangingAroundPatch.BottomPartLength
Length of bottom part

IdeaRS.OpenModel.Detail.HangingAroundPatch.InclinedPartsLength
Length of inclined parts

IdeaRS.OpenModel.Detail.HangingAroundPatch.LegsLength
Length of legs

IdeaRS.OpenModel.Detail.HangingAroundPatch.InclinedPartsAngle
Inclination of inclined parts

IdeaRS.OpenModel.Detail.HangingAroundPatch.Rotation
Angle of reinforcement rotation around patch point

IdeaRS.OpenModel.Detail.HangingAroundPatch.IsMirrored
Add same reinforcement on oposide side (rotated 180°)